19535
9039
875
0 0
1196190418526572547 0
3117251964976502276 3
0 7
3266452963994632202 7
6701451810090115586 17
10156473964989528067 19
6270220596053033473 22
8689732391113957377 23
345423933508452359 24
9048486634542125058 31
13000119181766437380 33
1008808785591799299 37
12586249368236978177 40
11161089178393358857 41
0 50
6900865085865625094 50
2615908179610132483 56
1617129254806601731 59
1607892326666533378 62
123501381755693059 64
17180234710792039941 67
17345742025318016002 72
7933590365928361474 74
16187522989672200717 76
14893593683284454915 89
6001767212789422083 92
1805417936920808451 95
8589625060174958594 98
13148488988905702416 100
6759231203841442819 116
798806762886474754 119
13949836854106156034 121
4277844318153606661 123
18162360468357982216 128
17429735113921325570 136
10428297564837543938 138
10174389176493224450 140
4782734429389924866 142
16828613770926935558 144
16924367891356487169 150
15473269356473895940 151
10277883249583756290 155
7398921953351034881 157
15672774546004063755 158
7032338026028942337 169
12638648541163088900 170
11956890857542837252 174
10813991647348979717 178
698603259209416204 183
104155371596876289 195
8849883347580968451 196
13523964487472320004 199
12948374094552270339 203
16624700721113753096 206
0 214
630014773304871940 214
14669827911540386306 218
16593543947487157254 220
16189120489289924617 226
5936869209199720450 235
6504800368776816645 237
17628010111075734529 242
16073662248530872322 243
15997624981342335497 245
13519486007586370049 254
469623719382726661 255
10478598590185625089 260
5239294057556035586 261
17274642882001730567 263
7924882265216651266 270
13138720901108912133 272
13741737182438464004 277
14608811194009491970 281
2489742908982890509 283
14952279757728973318 296
13432486964055121926 302
15397241996877524995 308
7400937882698838020 311
13309132794101168654 315
8519404085542453250 329
2551722931538879493 331
4492819152473235971 336
9634175483270757380 339
5023439465649179147 343
2912624940235659267 354
15615524075652075524 357
15131856319265032196 361
7560465986110364673 365
16393161300057821706 366
6737538541011470849 376
6394493716971627523 377
0 380
6957953643235488257 380
7533365794097524234 381
11551517784611555841 391
0 392
14017003685401013761 392
13868858036311946245 393
609890416048967688 398
15853752823436186626 406
13008887538399190534 408
275598997711474690 414
612244017304434692 416
265561555991638021 420
0 425
4771730300985403909 425
14595656195986303489 430
13010615142623560194 431
3520044222049365512 433
4843556531627173889 441
9544321596489038851 442
18097338319835691009 445
17588488217883868161 446
4553739803879796748 447
12247953831639953411 459
1685939678565356546 462
2454121115370725890 464
7699707784321416706 466
2322428462912444939 468
4251948422489921028 479
8009626371771665409 483
15830912148611917313 484
15530208627603713027 485
14550069280077337095 488
3074860258671426050 495
9819565310679728648 497
0 505
239920763215632386 505
4479084686100589069 507
7541436040510714881 520
0 521
18361828565940659201 521
13943609537766478850 522
1644071836581560844 524
3325147442114083333 536
9121949682662027269 541
5375060563545179653 546
11461944020052039682 551
10205876604940857353 553
17856338086929782276 562
3964733248608209412 566
15252617693956101123 570
5198588053258159617 573
7294352613378259976 574
14274593384918848004 582
12443356879762990084 586
15967601366558600195 590
0 593
1596502676746638348 593
3447763432008799745 605
2154246728958848517 606
1249748142575979010 611
12802117032328183298 613
14720455521613154825 615
14431397366571454983 624
8968154969419252739 631
61922506310515202 634
17332184019644205571 636
1580044533016865796 639
0 643
16037339623732295172 643
0 647
6451385579602643969 647
2249232807147062791 648
15969372656029624833 655
9184080755936318981 656
10444965622910510594 661
976846907109217284 663
15036566770534162954 667
2852219209756952581 677
14428186506827194885 682
0 687
9583345567128655877 687
8154021185610424842 692
7639653587249864197 702
284400846134645765 707
5822594207495943172 712
4666916656146452484 716
10837424823999667726 720
7662230599689246212 734
16769958284715374596 738
14214321919518354947 742
7700892892210644993 745
5647486165416790024 746
12807160877623480835 754
17202327424132939777 757
5849043248643779075 758
18232796011600235523 761
4957062118189902859 764
6105730765254667266 775
8753292226633308675 777
14066686889142136835 780
1047708050925830148 783
5555751253338228747 787
8205438979066793987 798
10100035083082646017 801
3037731532850264067 802
16470238215781450756 805
15841867742103541257 809
8087512074161331714 818
15493250668750321668 820
3797087601271950854 824
2623502875154101252 830
15159098560356506121 834
343051006899596292 843
16668194639613285891 847
0 850
9601059867653113858 850
1570493927206813191 852
9118300038493915138 859
9563382677447647747 861
5285530497249013763 864
14598000812816350721 867
15243372398425255435 868
9815541045508240385 879
408899826773384197 880
7463961818871554565 885
12980371725716597249 890
15376403281856848903 891
0 898
5841652391326774789 898
6476912065420260354 903
3963854010828661252 905
5784218172655345161 909
15327721657175197701 918
13180549833166182403 923
15904501101973266436 926
0 930
14206180323061139974 930
1106786522797875713 936
17058832169116321282 937
721828206256696835 939
0 942
8561789411832569355 942
13374043249168898050 953
15922789491870388229 955
0 960
16131878595889026564 960
5509499768642979336 964
12415614990376579585 972
11304605070154481157 973
7663245502729528834 978
2692663086158549507 980
14133757573751133701 983
6813598296480126979 988
13616528755765764611 991
16303994430841145861 994
12880492472155407874 999
14023778603465187338 1001
1658551813664662018 1011
8148008758896362498 1013
10688946549204321795 1015
13274653424094307841 1018
10847911221158770190 1019
0 1033
4643539771717744131 1033
4169507947260962821 1036
3126526255358650372 1041
13449815687571241992 1045
9421207081901200898 1053
6898163624184020997 1055
7290174431607841794 1060
2741902156609523715 1062
15499057183587255302 1065
16461426401301993476 1071
11278211202787295747 1075
0 1078
9413985875830324739 1078
4646548733144616463 1081
7078801759685020673 1096
5376123263925219331 1097
14227335667134915589 1100
0 1105
7295351152600562699 1105
0 1116
1397641409882635269 1116
2364632016557825025 1121
7290779788839345158 1122
223977268476071945 1128
13026660262516529667 1137
17998435953459809796 1140
8522469059272339460 1144
16293947433309880833 1148
4576500186674335749 1149
0 1154
4042247147937702403 1154
3034443556411821057 1157
13667368622259281923 1158
15202537810082257934 1161
15337640185400698372 1175
8308041085868251649 1179
8832030889396702722 1180
10436989792260434949 1182
14898581533124037641 1187
9317528159836099585 1196
1612938252083390982 1197
6278485319310800898 1203
10612805446261845508 1205
13787162434835940874 1209
12133705386992745478 1219
5227473436681376774 1225
5656787771058157057 1231
4433258109319585794 1232
6704526927800668169 1234
17440456789764264962 1243
6979104089888754689 1245
10768049747876580866 1246
15707303682313568257 1248
15148244407999994380 1249
2841265161354426373 1261
5252307512862989316 1266
13331565891980378113 1270
18159416118263116290 1271
501516395825858060 1273
3867012501081805829 1285
8267472486312505860 1290
12872828689431491073 1294
727773195231890946 1295
7322382021491738631 1297
5402024496579473921 1304
6959655625064837122 1305
10187142685062514177 1307
3029360479097259523 1308
3524388403479357447 1311
5803404108302127107 1318
3322880653425492483 1321
14014789072627667972 1324
0 1328
17779075582177396743 1328
11597164340541700097 1335
18164718194518923266 1336
0 1338
3688441162538457604 1338
12763684824056344584 1342
6555198237040291843 1350
8999497138912988675 1353
9277828726380557826 1356
1652226711750231042 1358
6386464493042135559 1360
11832103051565904386 1367
7889400420599073793 1369
5173699340624307713 1370
9839391635984425985 1371
9179189546563518985 1372
8987610858276033026 1381
14211262843725043205 1383
9924217736728436740 1388
4401850895204555779 1392
5541709837691148811 1395
10214740045672277507 1406
14656675767246138369 1409
5518164076312088578 1410
8819194535554354691 1412
1202694809888231436 1415
9937648736864647683 1427
4776509399304216066 1430
3828150896429232641 1432
9726415758235178498 1433
15478358790166008844 1435
0 1447
447632828248568324 1447
10254625284015096321 1451
9602208154038649858 1452
7918490636759656966 1454
4464032935723660291 1460
517803065456797188 1463
11296051306811729413 1467
9559870439106258948 1472
18140734313948729864 1476
5761393475703308289 1484
5817187969532432391 1485
7214411138154648580 1492
8556555308704695297 1496
5517275039512219661 1497
155198283803470849 1510
12028807386786979841 1511
9402878779861331461 1512
7529466829850301953 1517
3700043109242268166 1518
7889220073888590849 1524
9698905706548099588 1525
950350740255051780 1529
16659267722661032455 1533
11934825441675277832 1540
1840952787151591937 1548
3181706929772123141 1549
13084360636440561667 1554
7392348362663288323 1557
11299566685738323463 1560
11865504406956790788 1567
470806909387516931 1571
11392390055026286594 1574
0 1576
15250035972710306824 1576
1841748561073501700 1584
13959366503388518404 1588
16383575845586120707 1592
5993903773214649347 1595
12927537188954086928 1598
6310676060569643522 1614
6823572598110530053 1616
0 1621
10355215107753852930 1621
12991560131813107723 1623
6463225875312731650 1634
444925180768886788 1636
8287375501749122564 1640
8102699978355624961 1644
3217121844483982342 1645
0 1651
15310893597687290371 1651
4651888484278436356 1654
16622466823413339137 1658
14426029300798547465 1659
16208338759425902084 1668
13384891560853317123 1672
10542264124115582467 1675
0 1678
13404868863569442317 1678
8380728838811013123 1691
2656782871938641923 1694
5621105522992570375 1697
16165957063051496962 1704
17183335989224497157 1706
0 1711
12377944724210268163 1711
15698714840429098497 1714
2063306500131813891 1715
7135499884796623879 1718
14916197160702468612 1725
14565364212611500547 1729
17109666354199615491 1732
18420265465448709122 1735
5039636110599831051 1737
13648715526743665665 1748
8648155745742680580 1749
0 1753
4128476852805537282 1753
12229435493123252233 1755
18671114624524289 1764
0 1765
4330985506003776003 1765
4960636854468069379 1768
2825174586054641673 1771
8083214972260871169 1780
1656668836635006471 1781
15658718806708214274 1788
1364137667359422465 1790
5440910769879224326 1791
1242060995600047617 1797
6028285323527704577 1798
9862524515548398083 1799
14095132043223516673 1802
5330121798209797643 1803
3047808178481674242 1814
7009881287782938629 1816
3836453927748870146 1821
4828562734878493698 1823
6251707885160171534 1825
13503013357676597250 1839
13120060435028427777 1841
17453157023102628866 1842
6659266074333195266 1844
12122449770852231175 1846
76872493233309186 1853
10510620038219076100 1855
3104474465142299652 1859
15145875800387371010 1863
14514645157364972555 1865
5990940750853294082 1876
9568631318395414530 1878
13307393937882497539 1880
0 1883
13432428898749511691 1883
2851874300532727813 1894
16127254686981486084 1899
11152828733555106817 1903
8099684063905722369 1904
10726727557015251463 1905
0 1912
16773004137299201537 1912
0 1913
1737396243104320517 1913
12312810570815952904 1918
8420117868402509825 1926
4468099455608655362 1927
17181412210024682497 1929
7344171998747088899 1930
11200240032637073926 1933
9773885730549905922 1939
2888420847349521921 1941
0 1942
3301971714535044611 1942
6622000068430301708 1945
14679279568503564291 1957
15312513401406547971 1960
11219696574507219971 1963
15557068645919193090 1966
14518831268196627465 1968
11306244334020066818 1977
445302382600591361 1979
4798518764725378563 1980
12833053520101596161 1983
6569110733351726088 1984
1133142439547627010 1992
6020738327851480577 1994
0 1995
0 1995
15123217074875560455 1995
5146261845254048769 2002
15577303646915962882 2003
5068854713026915334 2005
5662217880612308482 2011
13584286678752042508 2013
17647669975855288324 2025
7092182408195844613 2029
5243600304614296065 2034
16379641210199802883 2035
6541142296931350023 2038
17648968980389751301 2045
3633167252938199556 2050
691728008305302531 2054
7434042972483105284 2057
1243474674683616271 2061
439217426838173186 2076
10460352595647090183 2078
5080394082232633345 2085
7346464481151790597 2086
8068677175549539843 2091
4859996294860352513 2094
12470823893961605122 2095
10033529424736163842 2097
10769920382809060357 2099
16128670331104411146 2104
2973668094989328385 2114
16323032859702780931 2115
12227727930958763521 2118
7302528030871866371 2119
8967586997946816013 2122
13935701471042006020 2135
15676859696752227844 2139
0 2143
2397906929972799494 2143
731429270944234509 2149
14629591375919925252 2162
14201687141277194244 2166
8813493889730974725 2170
4967156306307785221 2175
12152782138863493635 2180
5716269545878689795 2183
12118250850399448070 2186
10079764034817249795 2192
9905170822798166018 2195
7330246949116896272 2197
4975588281894977539 2213
2377967791858227715 2216
1711948357573607427 2219
15733402191778006532 2222
13617127880905861132 2226
5413022680339381252 2238
12001217113207191043 2242
605362804928389124 2245
10888521749365150723 2249
11742554576381655052 2252
3591551764774430724 2264
8647496912976230402 2268
3843626828621262342 2270
3921763517492323331 2276
7707493410895858692 2279
3920334550068498946 2283
2658528064200329217 2285
9038122947820533253 2286
6952499746958836740 2291
7951530266135717388 2295
16076637508890388481 2307
15187897527562671106 2308
5520701509759360003 2310
2598679891400145409 2313
17512255026679867408 2314
10995766946592999425 2330
18117038245928559618 2331
5391766950501834244 2333
14461374868186265605 2337
1273598128050393611 2342
11820949665032480260 2353
17841646829021216260 2357
10200569215461547521 2361
3670141860910412289 2362
18396940417538187269 2363
14261984156631670787 2368
106960762513502723 2371
16393357936187300353 2374
7032931990465729538 2375
15907195827890083338 2377
16437195285078765571 2387
17301257309241798147 2390
8236593629924756481 2393
1379157623727557125 2394
14767417508072398345 2399
16695407490005887489 2408
1414009372711604744 2409
499004129948061185 2417
5775255721778604547 2418
16754393591199635469 2421
10568987941526160386 2434
3311623553148127749 2436
10255724520964794369 2441
3121950734017230849 2442
2129428121322164230 2443
5233872436075409922 2449
5115946926893418500 2451
298818270766586369 2455
2534391384903305218 2456
13962240998865999372 2458
2858192092257344002 2470
2246014736733727747 2472
18208224108542041605 2475
5900635063125726209 2480
8459478259862856201 2481
3106812066263162882 2490
6016756381746226178 2492
375597697640802819 2494
2513762961093744131 2497
15366269329105501700 2500
10035949288505144322 2504
427851159373997574 2506
4274431321888115714 2512
5253654952100000770 2514
16894221500064376839 2516
14687193167626954754 2523
13771965837935513090 2525
8874009193925074945 2527
4974093839237721093 2528
741620693598341642 2533
11991618038806280705 2543
11116672093208526850 2544
15807249887587362818 2546
7323942637968351746 2548
3660270925885407751 2550
0 2557
10684033640943126020 2557
16989816981004759553 2561
9001924880900419075 2562
1998443310251235851 2565
17567979874939109890 2576
13652482471668535812 2578
17509569230481751555 2582
3182500785161561606 2585
13325982159032983558 2591
1923914978402147329 2597
5589189981371284484 2598
1161601912578541572 2602
1916235467976744451 2606
16280831412119656968 2609
5531274414859838467 2617
13599333592024061957 2620
17989155199582565378 2625
3030922814179764740 2627
14644007464957335564 2631
0 2643
5497605392959732225 2643
2032331457863458818 2644
8100338548587463682 2646
993329328502006794 2648
6750921732510502913 2658
13748899324120622595 2659
15617703054210413571 2662
13138109094843573761 2665
6544485718564688390 2666
4168731610225209858 2672
7315066071491735044 2674
11306658702491732995 2678
1460741416990041090 2681
8624484085251326469 2683
4952143576172173826 2688
11470130411385533445 2690
8808161070990530055 2695
3407659004810532870 2702
9761503347061253645 2708
347929962150473217 2721
15682869073661250565 2722
12636859761190001153 2727
2169559175677957635 2728
6583723534446631435 2731
11332478688871909892 2742
3541912969021597188 2746
15665073567582359041 2750
6811971824255872515 2751
17832657550632072714 2754
8908928359280249862 2764
16149194899805562374 2770
16584564148406323202 2776
8926638669588577795 2778
8056234806465729542 2781
20557314279745028 2787
1574148835258315780 2791
0 2795
5593745704266732037 2795
8450014032945361420 2800
7024373575570305540 2812
11737655816003366406 2816
4727037432569372673 2822
8600949146786643459 2823
9003058529087846919 2826
14052664559056898 2833
1424791599736305667 2835
5413427196124183555 2838
13050600684981920260 2841
8589685071512056331 2845
13186761374251900929 2856
14090913721681066498 2857
0 2859
2742241767433926657 2859
6309431184810384395 2860
16867533333923942913 2871
555261403132789763 2872
5659601479152637444 2875
18276768397881284098 2879
6852010445819064844 2881
16631838326863331329 2893
246764640492975110 2894
1313867708490425347 2900
8944238870676823556 2903
1060867472129666057 2907
16635885715046522883 2916
13334184179287121921 2919
1341139991463623173 2920
0 2925
6310211216600221189 2925
3521973268169620995 2930
1462184866304097281 2933
8359017763585949185 2934
14138351761235446785 2935
6817592922583008262 2936
0 2942
6385096150346020868 2942
0 2946
5484657660585723395 2946
10615912620259059212 2949
11956475177743584771 2961
14617995947569946629 2964
16460942815259223553 2969
9814422111234662404 2970
4608931955518876683 2974
8617716815688349187 2985
17740454941921826819 2988
0 2991
10586556775954286081 2991
11028786367153901576 2992
7561184979369551368 3000
10180555287637633027 3008
262376940139235842 3011
1252244297117510657 3013
17286434400127825418 3014
11940732067173687811 3024
9446744360256471555 3027
583923543216445954 3030
8153426984110241281 3032
8998238685693393417 3033
11022193474305971204 3042
18018779292443289604 3046
13782486654821986817 3050
1031535266324627457 3051
17367371162468022278 3052
16063095350159409665 3058
16006913374966627331 3059
0 3062
317830424679224322 3062
14882116247225631239 3064
9977848214775454210 3071
15016859152309685763 3073
1451917599200393219 3076
14163345466838668289 3079
7124786413716748809 3080
8972415547684808706 3089
17905923295565835779 3091
11508735911159903238 3094
1060738927182784515 3100
3235164743035444235 3103
7249634886133244929 3114
13627026919527422469 3115
804144428748921345 3120
4260278694170215937 3121
2554890109424057864 3122
0 3130
2939022249034957313 3130
3727916159743203841 3131
14170274700031256577 3132
7153627445263524879 3133
6798175517396767234 3148
1899052595905691141 3150
4651137331222245891 3155
14020723224952528387 3158
5768869715157669895 3161
13394211108659571714 3168
15788932119193980932 3170
13584005658508513793 3174
9286626632069867523 3175
2398026920081879562 3178
1285989134179298818 3188
9371873775174273029 3190
18182246561705410049 3195
3627164815665507843 3196
18002283031389555722 3199
13723140536667785217 3209
11940684153082156547 3210
16151440538186193925 3213
13475891972713434115 3218
5932226594251481096 3221
15508203776273810434 3229
13958242421862434307 3231
2178759546197172739 3234
12536204645038731778 3237
14021691565090239498 3239
0 3249
18424936840617633797 3249
9515558058741110274 3254
14427656809453646337 3256
15295479713001905676 3257
6924455800485778945 3269
5547275743159208965 3270
15965423529103676930 3275
6276065480049782274 3277
923852355669990415 3279
5171389834127005698 3294
15756927494767584258 3296
5380717287071449607 3298
6048706605171842052 3305
10493631130929582093 3309
2792686703001238018 3322
16318095573166788102 3324
14961739739381704706 3330
13885085964549002242 3332
8803999472247604229 3334
13681809489997040642 3339
1274343414475602434 3341
17525390131260455942 3343
4637625228183366658 3349
8313154017818126861 3351
13090076428282480132 3364
18133227728108545 3368
8282473413611347970 3369
107193099920609282 3371
8505179371271580173 3373
11102079825957593602 3386
10212767298703785475 3388
5215453497761775618 3391
3298152084179375111 3393
1095163960428030473 3400
16887781145875813889 3409
14786085928210816520 3410
8581278387803219458 3418
6241337607249230852 3420
9254719800476612099 3424
2568855290428722689 3427
1289519920250085381 3428
14618186241114017793 3433
9612541243912769538 3434
13926515287424429066 3436
11093957915681312769 3446
12010544601346956290 3447
11839562359654205442 3449
6839541636025740804 3451
6012482217637302795 3455
0 3466
5775335776577318914 3466
2685494297938271233 3468
18186802079969910787 3469
3127521196291951624 3472
6934893239724900866 3480
11630798772510404609 3482
2767762624498050052 3483
14135084772626181124 3487
11643008759045397001 3491
3500
14107087915135404740
3545799512027105927
32996413518841137
15568274631689570656
20587511236070012
2390363305266056430
3863606920688567965
210658854139
9870724567599405
103154228
3007753865419557454
493093586
814220189
538968856
45810044
11403474
2625321602296383846
3076135121411313050
16635669954819197974
5514354727165429372
18413391979390173264
3544953467117898450
6361518319333476776
5833854247140395797
518849275
2752627
71565807
9870724570416301
163316374
60096910
817038254
18411417877468545037
5993603989931887912
1873618523431177265
14787093348585572176
18413109988782047308
1283692271244348427
17461812017531651650
13165236096819726043
14883032307819284131
2789363538679106064
11161692095903435283
62914993
2365498112266798670
154665586
13726068529822894439
5570718
544604964
33560368941433940
819856323
1873618458944931675
1873618489039064439
6156738032733324876
10259573046193883986
6208295848581203181
5991347927496394467
2272905061487347697
8972557000702888938
15289397384024950845
4767727591019973374
10758418391935812957
2292825785040636736
1545208828
219257441372
5569296714050766113
2207492642904016905
12612941966326959190
12426051065400527122
18331556280207363
2785415334835848520
6156737968247080128
15292217517958891614
5780604328577598853
3188833133853148985
4078298757842341053
6051485356288903427
573178715
102957618
91488775
2625321602296187261
114426460
22675774
11206864
9870724567402585
5406444726343502428
68551110
515834601
2431124533
538772246
11065179658016983681
8930986418384079868
4076606646528706921
1873618471841499416
3701601059573925529
16166203682344470241
6101795981361546864
15289397371128186695
7569568047215545466
18411981910273949729
16759426304739641933
48431492
24535874148371011
14024943
59900299
105775699
10770155859627543824
71369196
9870724570219682
163119765
2530739313276357975
5052785364214352114
805372789
5652457623480305518
644809585
816841645
2556016
4501477955215362649
4502324021619918399
2150364451440035988
6156455943246842659
1873618497637649718
12309852946450942075
3660444556051220001
11103300151687644832
8714520725396523830
5461104765611607541
27356033875641745
5352348805862394041
2012415014
5151629580948802356
5374107
154468975
108593749
62718382
16843031
28311895
1107456968073808590
11490081257974859839
16633695840000739887
9386257335747873389
4959080478982475006
11408348231855703653
13464164481390611573
15494005608834598990
1407386597
8192198
219257244681
42598769
811008904
2573543610120276856
5356297048398365877
7595953279435999504
5726226297114658480
2723374776553770162
1543385872365455415
11535686880442518166
15289397379726773461
5565348488711963913
504169174
9870724567205432
14212253575230457510
5831598111619679502
2625321602295990612
572982104
813826970
279448324634
538575636
11010253
68354499
11243723090649876783
18331491793766525
15292781563660995825
5991347884505304103
9409295256684857617
3759645248384009814
5832726134240118664
14312300901618944289
20305615210743190
13001845694847518363
2652485274356286816
6151097653090126690
2203332276215481610
18412545964574834746
1808894516123993997
518456056
2359405
1321272283
71172585
417019398489
18895516000586505
162923155
9870724570023121
13828334
2625321864544389907
816645035
8453377129057749572
11949535972653271176
1873618467543321286
5249797181178709209
5567604589840172352
3707523343842937215
17088205463377873568
2169005683868174908
9568723490388248888
6103488088376871190
4025969582498383295
62521771
18276979644936029994
154272366
16646420
544211744
28766107292140894
5177496
509805280
1873618519132801026
1873618544926132491
7676326001635166459
7676326031729298383
869984510486186619
13146357072728951328
2000487899013646903
2449021711964768402
6155298010574883251
6098975770044401989
3189961199463959445
2676033351739376985
7995587
19464489
547029825
219257046468
2021331689141374237
15288269301218674108
11705421198335413148
2508194873
2625321610894575340
6097847713031849822
16064731596255856452
13701595356116683915
6364097396127827248
18413391987988365394
16364556117061994922
10296839827164892306
5403008449516603011
15858116883009440274
5833854255738587405
45220217
194314911
10813643
68157888
56689033
114033243
4287350266942457603
987047180239768912
813630359
18411417886066737167
18413109997380239438
11548493110908749415
6364097387529046615
5561348123192067576
5835546388547569431
5246976935469649046
13884327378110449525
18204249488608200784
70975974
9870724569826462
816448424
4211213383
2162794
12974919760129952993
105382480
5459976661309982295
21433723812579518
32432320527074663
1873618497637255436
9305858029919208637
10225919154718574351
8597156797828894009
12461042340477994821
1455946274504313841
9538952396691934382
927164962728314711
5782296426993943791
9714916684781063078
16449809
4980885
819266496
2625321589399030850
10907429529076434052
257295025
39387493
154075756
62325160
1495925747
288043895627
4504298205224635444
14835085562484362568
16881139122607162703
1839046019115124804
11923578915473263059
9388513449772451585
5247593352907982888
5153885686374731086
12020808312486431384
14848239906707278405
5405598728725530322
3653991426073234491
5566476498435442740
4333982245204396969
17007720368052373541
14458654042895551171
16885259953617962521
2676033351739180486
6877309693745106245
21997713627284659
7562235540534921217
2625321610894378836
5458848587099997499
1647838213
288046714075
1454859013759438228
1133620887485417426
237175467
810615685
1418462186
12162857194684744950
88080898
19267879
7798976
546833214
6206321690771522709
21433680821684597
1873618480439692390
3932922014897081298
2549492329236335496
5249797112394286460
12294570438877711433
2324121364801391676
3315661715940248009
8971880411373045432
5461104782808583112
18411981918872141859
15371922320578972378
361675971417279818
90898949
13390152586296232130
492307151
13522668389390157414
538182415
10617033
12498251711624252784
22085946
1987794462939089941
425617786716
1730937871
5356297014005859746
5569296739846327213
16881139139804531782
4196703391028741586
1873618476141710425
821147663836514852
3158171969379764633
30176223702288623
17735566651085687884
1427238547443354327
10223260478367337870
10720606758114626648
70779363
105185869
162529937
9870724569630759
24904017
2681814701524780811
1320879066
1584661506
644219759
13435115
6097847786116483627
12477949191893683608
6925759835249836137
27920040887322186
10003084053115964048
16253198
153879145
2625321589398833886
257098416
4784274
9103100569952650951
12474564753552836994
1495729137
62128549
9774054990929462949
5356296971014964874
6153353870293665804
9568883447315500158
1915314009235720841
16655465042802838677
14866462842593414402
2676033351738984017
546636604
535167753
42008942
30540122
6365225483234117329
7602365
282854078
2625321610894182276
13307798926833551183
10913926882465549337
15906307047154976446
6104586261131037638
8483828720841721486
15287423226215073909
17785259896117529586
2785415278947600352
9000175594581527004
14425661002709010016
5513226652957347114
805679481429165719
17859691850682797212
9181555677596944971
1363739614
9870724566615620
537985804
572392279
15175534989820758889
1873618476141513316
2152780467316001469
12601357272775920269
16765215479188031591
6534429686359852912
6366353553143235674
12689613402799605860
9138963602338286574
104989258
644023149
361131345578
816055205
9870724569433729
70582752
1309213649
17634738504986593825
5639662680184522626
6316393479032998553
16340493341965880015
5344573059048999857
34124461934314600
5994450030541998229
2625321589398637514
2676819007
15515140772745448064
498702419026
227855238971
4587663
16893851890367073119
14264208198271043974
555090760
818873277
61931938
16056587
8821966780582857359
18411699885273055253
4861149623842704773
18413391996586557524
18115578910873816258
5832726151436896491
365262179507571896
16896582888638318388
4445946672738929841
17186370630874106258
810222466
7405754
2507605048
17607182983838566334
546439994
2679637056
41812332
99156525
9140909979694467183
11742834345080916462
9950583114428779661
18411417894664929297
17160329975787685834
1518418407735101149
18331556279224644
15289397293744393060
13950077918785243724
15287141235606883137
2789363555875490728
491913932
90505732
214958474959
21692726
2063139881
9870724566418979
339635799228
11740202404159819072
12769623874203027091
7171706723174648069
16156684754098128751
6208295835683456476
1873618476141316771
5882159696614657105
3431717683755289915
1873618506235448739
17166316876055971050
1023125932615797552
22279798815198594
12346762090311779845
162136717
331037018572
13041896
1733362705
643826540
2306802734
477206873177
17309267256018536307
2625321597997222413
517669620
620888934
70386141
31022281504720056
7409502855497715015
6155045934318095559
18412263918078459945
5458848625792321791
38797665
669582195
27328854
554894151
468608091255
15859976
4287350254045103750
61735328
4391052
6520986101609793850
153485925
8510664359869943178
11050161621988804687
20869691006257762
5196265237615086368
3491703531359374171
1873618489037883086
11633356565151157114
16633695839999756254
23407812836853915
1873618519132015281
12074216556992400767
6153071832396467338
16120716880803858984
5299098848608717979
17149817495305717193
18411981927470333989
3308118261903721908
5831598124518278362
7209143
810025856
797977540607610221
98959914
7470284155521404014
2564752444
1727529996
12318365723907459763
5884848047378859255
13222096480399396057
6314795724398267312
4397798316509039896
3974700764184054454
5514354709969504081
2893509029140760671
1873618514834032208
5516046791188875281
1223976962194278208
14737352740221028816
6368045642960996241
3489447322753895731
21496117
9870724566222277
514654951
189614828176542708
214958278120
491717322
571999061
6367324841362000185
10375505339483621145
8070938101082033295
5569296709751605280
1316357237551401394
12020684574736647824
15991329612793777185
10697899350700788395
16739161091967945306
3891732840317912522
1899651063193471062
161940107
24314188
2224234517276395067
17082847207615301902
2625321597997025900
6152225714402364510
12845285
506004186
1733166096
70189530
10906583445476542150
563348302
31022281504523376
1873618527730601376
2530175340657839273
1873618497636468806
1873618441749006513
18412827950883864637
6366353518750729401
1413046597527668667
4078298775038527628
5565348505908348542
4022831255438034250
153289315
4194441
15663365
11700344903086704893
73007615
818480058
296644709200
95945236
2150364417046743283
30740204914804024
15290525359355331959
4237766475632413481
16758489844492275047
5408700909154273182
5153885660580611393
1873618519131818153
13951205954302051853
3597357340772992368
7432602967203907143
1880166538706292058
399811749952817933
10381427610856195682
4644563108626631009
14665351642484132
7012532
5141736951422061236
3344434243
16330874579771459902
1873618484739705502
8550520059753138843
4645667113710455153
5885976069999102359
15501473033754248808
9896616181508082455
5462796868327967227
14585410861575638263
214958081659
339635406848
11818157132458100908
11526999220155450649
18613533990193666
1873618450347593089
3861350810962691992
684134305183500639
18413673995792875610
15530271666638163275
17621561863500597513
4238330517036600601
22279768720672168
4502606072414800438
10655291933708585535
161743496
517276402
2625321597996829544
12648675
563151692
1308623824
104399431
236453432350
4279043148
540214046
1744643526947965735
2065251783916127931
18411699893871247383
5459976691403131036
21715680027609308
5726226344404977639
15292499491370895395
18413392005184749654
1873618497636273356
32432320526091507
31304323701802109
2576363817137867614
1631882651478526261
5995296157134227520
7558005371879033601
61342108
95748625
520094464
15466754
3997830
5240846595623881868
5887800020369606783
15288833278135765839
818283447
72811005
5459935770830768809
9355193091131312182
18411417903263121427
8430474765433179073
5247593352907000017
27638110466671725
32714414313178248
9234597529149245860
3229097897723824621
7449919019336600171
2413828615876118471
2414448843017751282
6101795942670075923
7697026996393675938
31304285008889193
15777957523720635747
3143159678306028631
11065487220741573048
6815921
2140013610
14282671233461718187
9230753948926543533
98566694
2625321585100065781
5382561551670903978
259130038
155910777
87097857
18284834
282067642
545850164
33278352538406314
21433680820701635
5625593289148533238
10512763733196344280
3784125305237867347
1873618514833639109
32432337723461001
1873618454645376983
15292499534361593441
5133829485925763690
16904712944497920326
5511666277521099409
5622264654903379074
571605843
514261733
491324104
2625321606595414132
21102898
1385890784
524384476410219715
17257283880273643533
5195701200510977145
10280579133800254203
200191596416994196
1873618476140725820
13117263636444153530
15096032016463431129
6729754102968812754
18412263926676652075
31304272112126853
12118995007347033900
1996555300
9870724568648556
540017436
1319896024
4236074403011431549
1606616067
195953314
23920969
104202820
305243098454
12452064
5248157445900799208
31022281504130688
1873618497636075077
1454041666728626384
1873618441748613384
15289397310941170468
12999620585941961275
5875369294806846690
18142877345697171235
2789363542978135882
18411981936068526119
12057284352529139627
356832576945
17092164759424403479
1460339693
3801219
256115374
1987904546
1964966944
15270143
33278386930321618
442814170389
818086838
17462509665872383079
6206321759557388696
5408471212899110030
1873618523432225060
17353152791227993245
6261827792145090364
15223822230290106035
15287141218411547437
7576852735584046364
9714916620293637762
31586271318836879
41025899
2625321585099869531
223556471268
545653553
4023356732265137752
98370083
1531970550
6619310
23689824939607125
9950019064427710530
12424382439595706534
1873618484739311861
18331530485106038
23407864425745813
797695489810761887
15289397353931868100
29330157293733695
6101795994259359091
7692717626264324682
5299098870103476096
9813006656186419950
3591160524196219107
4129856608083381232
2755882956846859930
5352348797264856883
812254097
5524868651610213131
11124082762859154482
2857298572705729021
19177566795402134
18301216972081072101
2625321606595217579
6152225753094686522
548471621
5512098595943810546
6584302816815089825
11092808190891527547
5941764144784016877
18412827959482056767
14428481252717692252
5301355009924597043
12284124821458521275
3577503648415550265
9870724568450966
69599701
7431889721301470079
46662016
35193182
104006209
12255453
17877509356004052233
11069796553860646809
4347925833116091776
10590197086357423689
5570988786672405753
9297735470756268616
14637903957824965363
539325825270679628
15584540329550678645
17247780946628644032
15073532
1574831104
72417787
152699489
496763604
577045344
817890229
3604608
6204347606046083061
12771845711499103316
15290243377345399572
11127945220196076778
6208295882974168451
11846037961957312985
13106160036035691955
1906986264008723742
4657106642463886071
9198943117821938833
15270695523793439937
5246976952665638015
7003516464553396964
10956724774926813288
820708298
545456942
63766972
4585257123188181630
6422699
17891616
9117971362513815455
18413674004391067740
14597841535548131734
9772926989806013640
1873618458945784014
4522983015860209939
13806855580317125108
15426482629288462533
3506237898852665380
5787083718919720300
13322381941750499717
13237708531286474753
32178524
490930885
2625321606595021110
20709678
1706624008
513868514
245051624454
525337347
16483453074211931840
12217235256243064050
4794173760728861833
5347351719937377689
18411699902469439513
30458205707308380
10750398672578676906
13351948495571782591
18413392013782941784
17088031212435737557
5105416417023100899
11427331956784106382
3698377064120454404
69403090
1629160452
161153669
17153706162049649384
103809598
15580874133512784221
7872981661881076049
2544766567488424310
8818864638845060491
1597536180772867045
17631161371525515669
4977791693940394179
29048123694646491
15288269284022357372
806224763
26345813
72221177
14876921
60752278
3407997
152502880
2625321593698257851
5675796551176948530
5337229686545450161
10649664295314066054
18271599167641487963
5741055947585816645
1873618523431831649
9763237054719266042
5778348175860436286
11906248855590275274
145335345147610979
27356063970624739
2676033356038407648
6226088
7285785859232107205
2036204584
109445719
5779476228575003910
13117159209037203716
97976862
545260331
1839046014815569788
23407778443758207
13885455448020813663
17091318705916150977
14749580058850363919
32714379920475611
5511666307614640107
5780604362970367638
18412263935274844205
4767727591020628301
5885976160280708469
1396769762
811860878
5996988225456246061
9887461037680036022
490734276
295544243748734701
30458205707109873
9950019055828534995
17090754617222956318
5566476545725367766
17648172271756969893
15289115277341755866
30176189305784773
6205475701751155414
9940375093616053431
5728764444739437994
15140097999495498431
6523880655054768550
5727354401416743090
210659313158
1456931819
11862232
527958790
103612987
4278256712
9870724568058057
69206479
1997667722089860216
12339564610979564477
5243108696682924272
23125779236849772
1873618501936285414
16044698410490725659
13669583335851559254
14425661019905001872
13681696359428851594
16161820259100396848
72024566
24535844054893958
3211386
817497011
9870724570875039
60555668
26149204
24535874149025753
806028152
232154663489
507839197
14680310
2625321593698061230
15273884660262766886
6633286351216577743
1873618493337504776
3094190453106412515
1087507565178193378
8481290603310483360
16885380374869314205
5412367062202975465
1372824966366170355
2543805385922512178
27356033876298083
2676033356038210923
820315079
63373752
6813843502384089093
97780251
258343605
155124341
2148672331528407961
6029477
17632571483632043275
18349504802666319185
12133908888583014197
18412827968080248897
6100103913039400051
5249797202674912471
1873618458945389823
16271603835638319461
605557034314828631
5881866613803452649
3544107379218385465
7406761759861377295
811664269
3234866947851553000
43254135
10675690836223986039
3346269252
17946608694533885076
5459976644113468289
15290525376551717170
5946696443085589628
3477193953305167424
5353476789790574588
28202091681942395
5944020284604679310
8143564249694210398
31304332299601191
8856014216854636141
160760449
28766090095429261
5727354401416546168
421318034537
814482337
103416376
210659116497
15505670362359531298
16893851873170950707
15515478115209971466
46072191
11665621
9870724567861628
23134531
69009868
14105033451515939293
1784112314702629632
32714336929384395
853643387796785445
4713167439824750602
3812049126336301758
16130159995999161574
15289397371128645360
3910652327921846506
519111421
71827955
9870724570679212
2625321593697864817
60359057
326737659857
163578521
17219576355390295334
197984938
817300400
3014775
18413674012989259870
27638084672359236
6156455943247300775
18115860927276518423
18323667541285735009
5572809636518234139
2581508047683782932
13237708539884666883
2524806027085153844
2676033356038014277
31243224015702806
12982659022915898414
510460641
464308734399
2219404100148201532
544867112
438515402871
258146996
5832866
97583640
63177141
21715697223994697
14657391675119111356
18411699911067631643
1873618514832657292
15339421027537585423
3545799490531822688
16916327697533962956
5299098844309358384
4127600472562141528
8920676095134336910
5133829485924779401
6151097665987347595
6152225697206437786
1706034183
15897859265386515143
43057525
536216330
943759021439519007
10939233345785957508
1746899701160150410
1384869222252743071
5881302580997523790
107356700000258304
11287403619712895066
814285726
68813257
279448782049
539034393
22937920
210658919829
493159123
91750922
5831598081526006949
103219765
45875581
516096747
9870724567665640
2625321602296449309
5568582435113995179
6154199872212897041
5356297009705911966
9001701177466488459
6425213859614951480
5129024196560096606
3971798877726246151
6471725260172231870
18412545934481162291
6155045908523191668
27356042474686002
11226550812567014265
9870724570481756
417019855960
12512221777814685432
2625321593697668091
18116424960081923281
14287090
2818164
71631344
18895601982637667
18066207382028748450
5353476806987745228
6100103891543657570
6996745855548787140
10594427319500605883
575239712866634722
3870997034531752803
7239633818635733091
29612147900877606
8865366478519731984
5352348805862656188
8709732826087622782
18412263943873036335
40042856
5245789596497153220
819921860
15580874176502892132
154731123
544670501
62980530
17105177
4254959725487523541
5636255
30458188511970924
3973491001936446780
7410173966093388838
8704274751914773568
5885261859847867262
13590665243542948895
2412665810316625225
18613516794268696
1873618514832459339
11623400942792738969
684134257893444250
9126223058424237061
10530167802300925091
14267039342724252928
7042731044489660311
811271050
219257507157
16204201012116260706
19923244
2248112069177510680
19741625396299098
14311172801615955497
313840698753
157549179
4662073785906890031
9658025172156550406
6364338522051512284
3599049409094225259
6177363118375897150
1801912319444323213
11272401
91554312
2625321602296252770
68616647
538837783
1411918553413126104
22741311
492962512
451411772583
160367231
9870724567468020
814089116
2528483177756102046
10370417990725208293
6829167367527204602
10167299845199168903
14284319595218536933
18413109967286566983
9881712940254169714
13819298136066198
10906513561824594910
9486667438472824267
10215782083327823122
3685635809078676834
518718202
1992881803100621054
14090480
59965836
1550910461
17063697102470777209
71434733
2411070513
17639632887023929831
805438326
2621553
9870724570285675
1192315333980326167
6928358494714596151
5512098613140196086
15611911946388048179
5214737420442796133
5778348150066318224
27638024483702949
18412827976678441027
8881019260503721949
5837238405281154301
5461104765611674055
4181978486829943864
154534512
5439644
755605599842665887
62783919
292345154665
544473890
567411536
15257764832492062794
15122676476569913436
5835546375651263675
5516046795487905107
10758418391935682553
27356085465188671
11400819049620310987
5245848947241584851
1728578573
42664306
219257310372
8257735
524354306
429916226796
4076606625033226775
10162787574158199843
6064503826171693679
1873618450346019367
5566476545724581156
2704904932763174902
4548309565419816229
12484855343804124176
879419277503368073
6153917830015027393
573047641
68420036
9870724567271440
2625321602296056238
2531021389865944442
11075790
102826544
6064762127302393958
5249797159683425776
18413674021587452000
31586340104504804
4469799173763958889
13237708548482859013
31586254122912349
9870724570088730
331037869860
417019463453
48300418
71238122
1539245050
644678512
2424942
11305519054433421356
15739206202722094240
18411699919665823773
4787251587801811388
32432320527338097
27920126869375123
18008952305986046279
4661227783988316231
2543452128325209336
12826571498698443033
16711957
4160546838840674266
5245848925746038203
62587308
5784522635265967958
5243033
544277281
6211116016906930204
16253215886083360174
23407808536904833
9821766011288487605
2676033351739442523
8061124
13012951802392676509
219257112483
547095362
1992881785902860007
19530026
810877831
2625321610894640833
4825924017323379312
8854886168440079511
3808100888100343209
3493395634074945822
12591757708863407913
5349308051975768286
13361048879788721990
4074350485214726972
1626046306171619904
8617826180017097033
13513914891881875478
29330183088506125
18412545943079354421
6405261049027955879
17939922315943150958
1410073577
7837634943338155161
85348920764927349
2625321602295859611
813695896
538444562
29048192480512516
45285754
68223425
91161094
10184384893691038634
17542946455516547053
4180850416920431050
1928986057181235415
6364097387529111599
15289397371127860096
2522831856378710008
5885976061401368013
21997756618246082
18412263952471228465
816513961
13678484518713821516
2228331
2531021385567766485
197198505
518324983
71041511
9870724569894177
105448017
5779476207078475458
13980703149896829784
13697261
12769025487284210679
2150364451439708714
4162099616697747321
1873618497637320883
1873618523430651633
12716605781588708278
5248951136269502637
11703165067112811597
62390697
5046422
521143041
16515346
2625321589399096275
154141293
1495991284
165610142
10528906628815718922
555549513
819332033
567018319
1095239150174145285
1873618458944406678
6364097374632348674
10811668319096800853
1465168459078698840
17269866578628118199
2676033351739245930
7864513
19333416
11034422950646711803
283116224
2625321610894444316
546898751
18411417864571256842
2372569380647405649
12754891682880490747
18413109975884759113
3332575624131774585
13536993689470216
15291935475760762248
6153353775713551670
15289397349632312454
9373330690077689939
29330183088310857
14264783202905229777
5995296139937712949
12269921124804135698
5885976155981547843
4129856573689694799
538247952
3598203394278688718
159777405
22151483
1409876968
45089144
10682570
3172873343893834792
15290243360149277503
18412827985276633157
28202117477106938
2057911839619745748
1193603335023233930
1410790466305853323
1873618476141774348
16643035121679272213
8716776878113885241
14581169549127125939
6375653898722412075
8694008299851745161
21997756618049241
13500652
816317351
9870724569695611
105251406
70844900
4279895118
197001895
24969554
15855332315905657597
151126621
506659547
5142301044413893172
1917322269
3137288237381257087
14409153078548760239
14633483086300318059
5780604315680310424
5572809636517250553
15592058013925444099
17244622751296785814
27356063969248337
33560399034844286
62194086
153944682
4849811
16318735
2625321589398899121
9374458755688828226
15882855708139391266
10225919150420460684
15292499508566297469
14065038233622153931
17943317531893566468
7031431794891230329
16385074671182940805
6205475624366966000
6103488079777762245
18411981897376661534
9796067026192895123
7996312456522828750
13487493291780736605
17245750799710423012
2676033351739049517
546702141
7667902
42074479
282919615
5515085278788979157
810484612
2625321610894247837
1544487931
9511403338599564690
5192881006389626514
5778348223150556659
32432363517642192
14046027923586223423
18413674030185644130
10771469979967884371
2229804632046437624
17480593072628501093
6368045642961454306
13237708557081051143
13331692090551241408
7677136701370927115
339636063086
538051341
21954873
492176077
9870724566681132
1398211555
8807886331112851129
5516892801706297876
16546579671803956126
13217980679449939250
8503320935775669540
32150372909516328
1675756474409617568
7721139320100816372
2541195915421354200
24772943
1309279186
105054795
9870724569498781
162398863
70648289
477207135345
3452050537366752044
5460499803637156023
18199185222634702635
5512098557251945790
21715680028265805
249849483538007723
3554388240579364748
9386257314251803173
10594427319499622429
15289397306641222853
29330140097217635
14311736903207619026
8856014234050823647
17855463731522440261
15291089478142986477
6365225461738636619
2625321589398702921
39059811
23689889426704296
2474797953316292924
61997475
818938814
153748072
4653200
50528646
256967343
468608354196
509280991
5463642917535614049
6209141923583494372
16122124
10375505326587315831
4397798264919820154
8054758354584013306
1873618489038145001
830399540494469985
5637072609524124450
13913370016116443160
18412545951677546551
2676033351738852867
99222062
546505531
18940198
5411521012994540776
2625321610894051277
374027977988
282723005
30409049
7471291
259785401
821756878
11229884474259868248
16357059045845960667
1873618454646032908
10542598463376395267
5887104182899575287
12393440069873436875
7730749911729375728
15289397349631921063
7621890105505615217
18263821886743185772
18058417591402760409
1317733333
511599051947
214958540605
67633599
9870724566484489
21758263
1873618532028844481
8328637003859953646
5509410163496651347
15289397375428069113
16436648502584675667
6205475697451599682
8929320279979198383
4974759074281293673
9870724569302153
13107433
815924131
2524775482
28484129580057898
206359759935
2625321597997287853
24576334
70451678
16432982289349543214
5459976661309458015
4237766514325588729
14322284629040564382
9697577994188492052
5759560470823897206
1873618527730862181
6153071780807051278
15586729198848181726
5558136817694803400
10694515171064744788
1988559907
5302201063430292982
4456589
1713308683
96207382
15925513
13650504529854072320
5458848655886518922
61800865
5779476232874035736
153551462
38863202
8099682237308012832
18411417873169448972
2787671431665157349
651404368114879038
17955470565775510239
18413109984482951243
14911447610171655366
8858552325786961082
13840095604897025041
5940918086979029952
5723537903358642458
11238431078799509026
7758478083289188556
2014710471177341259
12454108019635062383
99025451
3862478902367620470
17621268784989013395
7274680
546308920
27638041680086900
5991347923197297866
6208295874376239521
34124418943289166
27356081166223293
5461104782808057591
5357143003026951378
113312346
7885152524183078888
214958343888
309541536868
2395604016
9870724566287831
491782859
