26899
27424
7630
6426333292330182147 0
13252223380055024646 3
5882704289435550212 9
6321733446031528961 13
16925858182943808517 14
11669328216917812739 19
5294247126811358721 22
11791736821652368900 23
12420164637450604549 27
2555997454944503811 32
5716902217424485894 35
3184543689580575236 41
5057972979985167363 45
7621090240282984453 48
10769488495697926662 53
9891471851593553928 59
7137545520968866306 67
11133724959355647494 69
14072771761498798083 75
11229796758348255746 78
10335113958832701958 80
12015445961309659137 86
5618747999027884546 87
14804906647292574210 89
4820165439889075714 91
13688091397368544263 93
16727691607537650179 100
3488276741999727623 103
6549592276830752260 110
1920877547099994117 114
16919219496588141575 119
6305645107967263236 126
10223610973459260418 130
8913976733358517252 132
15451600598594003974 136
16252953075098561032 142
6721179465637834757 150
11221601620145900547 155
13772009590059881478 158
11952054166836464641 164
5024105062523116039 165
80305976747165699 172
7258347321137746433 175
5207745526605648903 176
15764334474362460165 183
7167659783529683972 188
1781924856142903297 192
6483003943497432579 193
15843420529897954822 196
10297086720389824513 202
13131638480309452807 203
14352357448556621316 210
5878913600417054210 214
15526784816636028419 216
9091544399317599748 219
10022285235145996291 223
13995005730165201923 226
14722943734524530180 229
0 233
5067616113376457731 233
13951706541326466565 236
16055548874133586438 241
11312108457032076803 247
18422676475813979138 250
1900195772270680065 252
6189523574508932610 253
18097268793121208838 255
9136510235514968070 261
3104742850847008263 267
4644272126595231237 274
6724757887078610949 279
12324532576228292098 284
6523739721561729539 286
13430833055642459654 289
490372734232114177 295
5384129877931583493 296
3009088101503092225 301
17587270521132563973 302
2626347126168326662 307
15657892849951852033 313
13832155776986180100 314
11508832331290833412 318
0 322
15033439199502132738 322
7488928688653514243 324
13289501989904265221 327
1916212743608814595 332
13572159745003877893 335
15891150425892429313 340
14702614816445038085 341
14451868528530935812 346
9158604817422694915 350
12775481447328799747 353
16765860888389768195 356
14376615941214208003 359
14407639808019372036 362
17874739812136390658 366
17301460032903022086 368
9970593990692114950 374
525231183980692995 380
15059282111668474884 383
12597221157531372034 387
16646174973902388738 389
9586434007749190150 391
3598500487112312323 397
8562759221323868675 400
657014946814650882 403
585072415157096962 405
17149635587492691458 407
4239501041255794691 409
2294837614232733703 412
13106328552418381314 419
16729704481229316099 421
17519686381941948417 424
3191300701099235334 425
12941508227617193478 431
8924089997979029508 437
2744664364572510211 441
2934860503477699589 444
15242371855309170693 449
12861770492732004353 454
1389014634696207362 455
14599652080344680449 457
13486132183224466949 458
16299959455619133956 463
1519069526753240580 467
1139379885805544451 471
10768203322260688386 474
15723645256550985731 476
15633761988199396354 479
16190609843472863750 481
6786231518997771785 487
11722302046053575684 496
9033511331096652806 500
16250254645335457284 506
10634726718646778374 510
5042757800274513410 516
8843131134449980934 518
7966740208874774533 524
4894881673640152069 529
5194086939775699459 534
9792202071600377862 537
10260299246555381762 543
3102685076977950725 545
7000376853595878914 550
15026617722066242567 552
10737246396982961159 559
1948082124284899845 566
4296479271603189253 571
7050246988387796995 576
12722077185813590530 579
16858426088115699206 581
13558030456457072646 587
8618053981767513601 593
8215847780886550533 594
2925642555282742276 599
661974359082484228 603
4241334741238706179 607
10092915943655558659 610
3501830659164661762 613
17013073919837351941 615
11804259742756750339 620
4142743752223275524 623
7978151955415163394 627
12615565359506564101 629
14876464454585095684 634
1683529562352187393 638
17854328842724121601 639
2606090101283456518 640
0 646
3971805999688107524 646
6990184044903104514 650
7514097107706976260 652
7819083612851799043 656
0 659
10681158656393593346 659
2017163397138182662 661
768423759854007810 667
908898440134372355 669
7657728066545506308 672
15146652204208737796 676
16868335992482494983 680
16843978430984844294 687
18224820953156894213 693
15719079816546418182 698
5182770065360449541 704
10900133776105949701 709
14489431106924190213 714
12370659184540575234 719
7855124676665453061 721
13222429099415022084 726
867175602403893768 730
16273231913943438339 738
15759862269188520967 741
7316128005750152707 748
3035714763895333893 751
5857790669120156674 756
14011774454504369669 758
7150973472529000964 763
4673859569883164680 767
12540355432246249987 775
9717897176823090180 778
2802226780594827271 782
10576358356085021187 789
13767557471536629252 792
16320412434965818883 796
14762159427532951045 799
16615354009400996358 804
13970381756506479618 810
16781073946586622979 812
7486783686975095811 815
6078509027189458438 818
3995303291068676099 824
5479341439007691265 827
446712389216697350 828
16790735987035044355 834
8921995217103058947 837
1481170722727642116 840
14299676522694716930 844
2659981631401145857 846
13207282269231305733 847
12784214327203599363 852
14326295248763372034 855
6339319578237866499 857
0 860
12608466626091520005 860
14859295773684641797 865
11898197604931535874 870
2229480581224846341 872
5846738288335559174 877
9725370168135339013 883
15822781396954880007 888
16811330747884838914 895
17716322139895515651 897
16464837151699347971 900
3786904978463195140 903
6410868577687720962 907
2778812527153592838 909
14693577102320505861 915
1350861333873981444 920
2814380518294236165 924
12829930200630042627 929
16628991282708512775 932
12947026021130878467 939
16097076187590628356 942
15148070465872583689 946
11108167369127673859 955
3206892489716334085 958
4539052088705190402 963
1426834792105161221 965
13477573437192034817 970
515343112894934022 971
5527450208917667332 977
3496168618997501445 981
2587910293229783553 986
11073941369356080131 987
8923292641230539781 990
15568167072161299972 995
16069902683897020420 999
5007337386159242756 1003
567322683033477635 1007
4620543624975929863 1010
15593294563512581124 1017
10575605843301480966 1021
13218611825122892802 1027
12248496335302962181 1029
3127864814801170434 1034
16555666137680971782 1036
13548718596655177220 1042
7241193476337120258 1046
5110772946702749698 1048
4244854883984040454 1050
10674166251929068553 1056
7335410226609437186 1065
3593013801595140611 1067
3818743414064890369 1070
6620653714823195652 1071
6442170192171499013 1075
466109424591569921 1080
10640132951210823171 1081
16849933183647582210 1084
1390321302705893892 1086
10233112304825031684 1090
15654649187699535876 1094
4149883982434627074 1098
1533240967468427272 1100
3966583984096898052 1108
17942961652983470085 1112
1270386354528913414 1117
17079196523309549571 1123
9760225674290530819 1126
14059923870329421318 1129
9155784716932255750 1135
8869311198037689346 1141
1056488718559348227 1143
1213655809798914049 1146
7899482766013468674 1147
12288330156834369027 1149
17748915623984675334 1152
4374709304243351044 1158
2767416676479964678 1162
2589438947070202886 1168
15587532835225317891 1174
16281377795876531208 1177
10416705134548249604 1185
12313420780782854148 1189
17660949463316398595 1193
10832246261242997762 1196
12629844666459314181 1198
12857120880602286601 1203
3028018613016745991 1212
9528731255267963397 1219
1879818258756829699 1224
0 1227
5431566929998911490 1227
159439414612021252 1229
13751851540102480901 1233
11944466234328987142 1238
10214833293063919107 1244
3887693229018076166 1247
15693692989774743557 1253
17014193421416272900 1258
2699633620722988549 1262
5464437081641040900 1267
6858703281250086918 1271
15036555272160027651 1277
8088003436408750085 1280
11442555094569039873 1285
12083357448873049604 1286
14976866298017031682 1290
12269039782296515587 1292
2508430774663352325 1295
8686432348604624388 1300
5864749039411210246 1304
15976948363161951746 1310
4320021043786085382 1312
8284330964861030919 1318
13259654221051933699 1325
17875972966501618181 1328
2152571483841142790 1333
6451519314511286276 1339
6636526145072509444 1343
14224839268501422601 1347
2282597859443765252 1356
9897934235283808258 1360
11582194532885413891 1362
4651481000249861123 1365
3047659846477762565 1368
10028568668399206406 1373
12182931768673030659 1379
1272797966832687109 1382
15089356557931155975 1387
727550366928133639 1394
2554565515632464389 1401
6018569371908769799 1406
17842510414265811971 1413
16250926204388772866 1416
14440589335679961091 1418
6855191469470948354 1421
11832172336751508484 1423
8862885948920285700 1427
15819509080143538693 1431
8923041754180962308 1436
17241341699581580292 1440
5203495341390798346 1444
12400271948800936451 1454
11279630064092023303 1457
13193209893360081923 1464
11203636975167751169 1467
8003285106610345478 1468
17667331114443752450 1474
11972552597492848129 1476
3110471011889501701 1477
8075002536871550983 1482
10969144201515075593 1489
6765947162456009730 1498
101688012168008711 1500
3201380800712878597 1507
18399050926384111113 1512
16114864375189894147 1521
9109310046762871811 1524
3051915264036293123 1527
11682241693401750022 1530
2005348892863232514 1536
18327273322054661 1538
13751358064078701571 1543
7815526944222482945 1546
13039441235033142276 1547
5067771148519478788 1551
749260804632562693 1555
9237737302805535236 1560
9083203852933248514 1564
8812721389971588101 1566
8195949045747636742 1571
9392435333497381380 1577
17398353046914968580 1581
15036378874633344514 1585
8746181497070320131 1587
4459539803873305096 1590
12577494977199187461 1598
4382666372083072520 1603
3280719655021828101 1611
4919275069972367366 1616
11821310318612980232 1622
8005555409001143813 1630
12774245900612643332 1635
7047859414521072644 1639
16668202696522705411 1643
8175997675260104196 1646
15942058204444742661 1650
14143271563385835522 1655
7239104608150400002 1657
4560489085061611526 1659
6280536257690364419 1665
16709623649144075269 1668
6427332975643309570 1673
11044101972524148741 1675
12088102694654329857 1680
4646951769725483525 1681
7410759969433814021 1686
17276822231988747778 1691
2492484270882126856 1693
3801823939177880068 1701
221632636473062402 1705
18053964916833802245 1707
4056945733879777284 1712
4421227014276165124 1716
9867348206812785666 1720
4807713101607659521 1722
14699140115844216836 1723
8078559737715617286 1727
15735963478506342402 1733
11756773399572305411 1735
17110141827238231045 1738
12953650364988399622 1743
4491924571036606467 1749
5396770535170365955 1752
11193801764277815298 1755
2589981738189681666 1757
18431505823793643527 1759
17743110746999235589 1766
8677259333219075589 1771
16340463414729404419 1776
7257136655931194885 1779
4472652040470576135 1784
9363434809536914948 1791
4332117071421900289 1795
3143661989830900738 1796
6708422027633293829 1798
10565283271475392002 1803
129394441281844739 1805
2483490487411335169 1808
12489677496978255878 1809
5876131255345591300 1815
18297641325726654978 1819
4531243625021207046 1821
1635260936383946756 1827
11158325349069639687 1831
4681402755756305923 1838
12988344078407895556 1841
7297462097538480131 1845
684220432921229831 1848
4142421143323227138 1855
3272541225877128707 1857
6528287690517290499 1860
14534922689356315139 1863
13954229503288240129 1866
594389941800882690 1867
240608957487626759 1869
4670172616454630916 1876
673923161847241218 1880
10812535589892757507 1882
12305183442511034372 1885
16570523454599393284 1889
14779987674320399876 1893
14733330936736168452 1897
15701301882780828164 1901
13387698460960232969 1905
16549827179501895684 1914
16567284047029524997 1918
6706936000812835847 1923
10080883488432287234 1930
12757036929000257028 1932
1963962998123956742 1936
2884572637564067334 1942
15154987921734125059 1948
16679408950232128004 1951
1631757205957266945 1955
14048121108876636675 1956
4179539938369312259 1959
4062549966120024071 1962
4416860969221262338 1969
12676363119812776963 1971
15955662244151492611 1974
4293953195579395587 1977
2674001442605617674 1980
8714878569108409349 1990
15688651380501473794 1995
4651195213970127362 1997
15687195046097879045 1999
10571267148295818755 2004
18303570670697134594 2007
5400532523045021189 2009
5292135109118648325 2014
1182887885429832705 2019
2816716235090490371 2020
9667066222839993859 2023
8133340692439111685 2026
5556894116812473858 2031
10185084917225741315 2033
1394825332357395459 2036
1501604756314255365 2039
1822866575613727750 2044
13129179454169246215 2050
4777123420496750594 2057
13541010411943408643 2059
2536575277995444229 2062
15209073480087155719 2067
6297655052913674245 2074
10838741769150910978 2079
13128743511326829066 2081
16270488170221972999 2091
6103317769293671939 2098
14724451152311626756 2101
7588213090223201794 2105
18260746792928738306 2107
14870829166659442182 2109
6191818920231044098 2115
14302022909615755270 2117
6389252376897630728 2123
14108480610565901827 2131
17406712424018496001 2134
3516583785684381698 2135
3958106226617587715 2137
3131584494079410693 2140
4545044857015051268 2145
770751167187638278 2149
3023883610335126535 2155
14885300700287925764 2162
2132364466252832259 2166
13222839489696433159 2169
13208087868677074947 2176
7338224996863848456 2179
4468617446590723585 2187
997164968732877314 2188
7061146599067994626 2190
14262443374421270018 2192
9798893984939276295 2194
9974572998445361153 2201
4938098233158201860 2202
16137774098575803396 2206
8195768834704349698 2210
771771027633210375 2212
12365697972121405446 2219
14282909170851132932 2225
5326055097454662148 2229
7381708680070147590 2233
8937079261918675974 2239
9420515725593300995 2245
2641708104930865154 2248
6420503186041208324 2250
15769870327827568643 2254
2782702211549438981 2257
3393483206417815041 2262
11610508459402009604 2263
5800886563505937412 2267
13596084878130674690 2271
5260436378280988675 2273
12705431953132085251 2276
0 2279
13705354589131200514 2279
12778157200571917318 2281
1914054198314532873 2287
7264484455943856644 2296
7164320967138175494 2300
9074432163785500673 2306
4496077812229171714 2307
2921568697558924802 2309
996506176798027781 2311
9906247659718389762 2316
18169855044293443075 2318
12345390066536357893 2321
17407381569639854599 2326
318172619929459717 2333
1421914787884342789 2338
5669642289975079942 2343
11453317155401127425 2349
2223846582166448131 2350
4746375431328524806 2353
5073554277806979587 2359
13425372529937893379 2362
9583781359185620488 2365
10957843772458450436 2373
8650840443260095491 2377
13124893756819419141 2380
13021478960627926018 2385
3147967660765405185 2387
15485525601980818435 2388
44617068728058883 2391
9710250365947829254 2394
5807682346348688900 2400
6097839351096822789 2404
4606003429894801413 2409
13660466851733510659 2414
11593659950924606980 2417
4002154502295369731 2421
1483934997030608899 2424
1859582975833406979 2427
10408179330505932293 2430
10669827413055292417 2435
18319140996776879619 2436
4248800956988530178 2439
13034710302652515330 2441
17567170204152826882 2443
6808321686469623299 2445
0 2448
5278230511099922948 2448
0 2452
3677386695877724163 2452
15549552635287260163 2455
3469683568807416837 2458
2111641668923883522 2463
11597509174240182790 2465
17643417438962207748 2471
1577800293959222275 2475
3162480519718763013 2478
13294740916254901250 2483
1144270971717391363 2485
18430194644964964354 2488
2668093099027896321 2490
9046491373366563334 2491
9262170908936343555 2497
14032729045064903683 2500
4328258586841039362 2503
9899817333988754434 2505
11737440461396683271 2507
310843349481358852 2514
11436606379057555970 2518
6475585618246676483 2520
14211971945354923526 2523
4800640263811384324 2529
9208829891802484738 2533
4749131371354527237 2535
3878074741560406530 2540
12320937426892220418 2542
2403196546377150978 2544
9612557625555031556 2546
18375163939875341830 2550
16728404996714006020 2556
5595286118468500997 2560
18310405305170792965 2565
629720284662393859 2570
7503195655604273158 2573
5417432473131819523 2579
6022351632963833353 2582
10916777256257149447 2591
16188254296793619976 2598
12093473217692668935 2606
47317406728581635 2613
9246347702533580805 2616
8481399952943458307 2621
7662114992065801219 2624
7916220850056535556 2627
415760815290034178 2631
10489087158983186945 2633
6667599939280436227 2634
13903585792683480069 2637
3622528046861575172 2642
1779761605919459841 2646
5239265943237394434 2647
7303184090149576194 2649
5674897490957434882 2651
18142505388502786563 2653
1785520512066530820 2656
17163573402472637447 2660
8577953251087588357 2667
2627199488914604039 2672
9667659542900979204 2679
1832544118120496643 2683
11968223897681778697 2686
6988139244023185926 2695
10651557630955715587 2701
627887148235765250 2704
8294632043675624965 2706
11323385820045546498 2711
10837924186251084809 2713
4375877852682798086 2722
2222260781610711045 2728
3653460420585890305 2733
1052808742534564355 2734
18107901428420213252 2737
17761634308715357700 2741
7005371189337602562 2745
1494197173987885060 2747
12149989573599746567 2751
2046851030016993286 2758
7314186342491059716 2764
4090920723329870341 2768
8824342285732235267 2773
18446628766570103810 2776
12991720394130304515 2778
14826244211091149322 2781
11169916046146884100 2791
14638360680200871941 2795
3319502201252583428 2800
11847779787912283137 2804
5834933662075077636 2805
15424377650738226178 2809
154049585915194371 2811
7770978261391877121 2814
6508287593618445316 2815
2600306311043968516 2819
14779543465517041671 2823
3553262932008185860 2830
1852774153035668996 2834
11483905303460638724 2838
13032812395431478277 2842
11867551461205322243 2847
15115461448934821380 2850
8719349022002446339 2854
13078729396456143879 2857
16568711797883062281 2864
4656892212568932870 2873
3925069196148849155 2879
0 2882
11680500104321768451 2882
17761361328849491459 2885
15233921209171901441 2888
16069382143996981252 2889
12050468555568716805 2893
6024355602014591494 2898
15491466897308690438 2904
3730176295718835205 2910
12376687257944105474 2915
9199118225089480199 2917
1764631027158157826 2924
13992599390357687299 2926
16939056635673017867 2929
11688170558552786434 2940
8821664725810768900 2942
17833012978199031810 2946
6260783109092551172 2948
1935755268811563011 2952
6487241970571092996 2955
283570535225211397 2959
13648562854737182210 2964
4664117887276527107 2966
763688552293346306 2969
6529688254448506372 2971
15260351245921271300 2975
1916136007698191875 2979
1834539794913890823 2982
2775787526037635587 2989
11763156005768688642 2992
1092594911140729858 2994
0 2996
4419531433215944707 2996
6999999411324338180 2999
11785242270931846661 3003
10591978301636015624 3008
11497987661675870725 3016
9182554279521832454 3021
15406715476570607617 3027
13160929778437461506 3028
9754980285916780037 3030
10200263878180932102 3035
322630679578759171 3041
15576094613065650692 3044
10766888572163741187 3048
6047917970983132674 3051
1894686728382424581 3053
14598421592591588359 3058
1723859045088450562 3065
12612041931850626052 3067
6135872693603599875 3071
4292180497288309257 3074
16734665470813511172 3083
7350343365128422915 3087
1912069528403782665 3090
14382599270810462724 3099
3316943244493763588 3103
9879725097601193474 3107
16995234703431184388 3109
10533418679905509893 3113
15083437418034798595 3118
13908773068790545409 3121
3714724982487627267 3122
17400398487743184395 3125
15012573759800968707 3136
18302577637635149314 3139
4329155602927417859 3141
4955580105976204802 3144
1961555922128841732 3146
10128733761518848520 3150
2640272647949941770 3158
7754490195698865159 3168
12142796706451631113 3175
17365815208319973895 3184
16557627206115633153 3191
15078370093569871875 3192
10349687794154673158 3195
3473694961957886465 3201
8710893672956366854 3202
14068106218459046401 3208
15092816646992609283 3209
7317603117343176708 3212
9653231067328341509 3216
11053152134343642627 3221
16249256179505227777 3224
15180991765724747780 3225
9340196072791032325 3229
15943985937385251331 3234
18049281030150509573 3237
5389007214454359555 3242
10879349353452615169 3245
1505686887629765123 3246
10340600516380348420 3249
10073894039732477444 3253
5442371936614095364 3257
18341777471877901827 3261
3646376112127875588 3264
9475935681098023939 3268
16403851393883869698 3271
16369925399260153861 3273
14673087273347416580 3278
3062172708593815557 3282
389919502164015617 3287
15592707824227780612 3288
10923576449159220225 3292
16070256542987941893 3293
10780641687743110151 3298
14938258687229143555 3305
9228629380951022597 3308
3849544379965376004 3313
5133414704145266177 3317
7759615546425464836 3318
4940041363170901505 3322
9746677496288287239 3323
14912819796131354625 3330
13906931667087923716 3331
1635028704095392258 3335
4469285243829704706 3337
16891540149900304386 3339
12024584009331378693 3341
18033958275920774147 3346
14704552965566002181 3349
9556244076012807172 3354
13849836578991994371 3358
5004058306996156931 3361
9104317561427680772 3364
5186152924099834370 3368
11675086100193149444 3370
8358271005386669057 3374
8180494178676660739 3375
5763987501538169349 3378
14487340952012793860 3383
0 3387
7864696194149062658 3387
12054240220681461763 3389
0 3392
283190023925736451 3392
3509006534716876803 3395
14668534603743471107 3398
13990589627805763591 3401
15848617010751021060 3408
9826309121836393481 3412
740685001787511812 3421
9020119639965696002 3425
14559936198493758469 3427
12085834785965779458 3432
16223004963757116422 3434
2896514598307802117 3440
17485471932545959428 3445
15554868036584886276 3449
4577536831892964359 3453
1996600253900945921 3460
7340514101386013700 3461
10947483546159474690 3465
6388534167866258435 3467
10487540096866119686 3470
15906422802762378753 3476
13312166502282736644 3477
9934255612740007430 3481
16483913253293223945 3487
5018822790659920898 3496
13500972563624937476 3498
12254103507180446726 3502
337741848304440326 3508
6758048624305141254 3514
9927511494523491331 3520
15040540160901096451 3523
1021276059161230852 3526
11597724480431874563 3530
12004663100591411207 3533
13902508431327814660 3540
14497969858828110341 3544
11493838376263182340 3549
360244801365123589 3553
9638713627733150721 3558
711367871437108227 3559
4386934598798141955 3562
17140314548338275334 3565
1365620891741941250 3571
1488555826583759364 3573
2912707432155244545 3577
7832891877743352835 3578
1897549891850825222 3581
15749212009931314179 3587
13421432881930445316 3590
6479924671423850501 3594
10703787529672778753 3599
8755134092082433542 3600
12275839735171805699 3606
6339245450180982788 3609
7912328405461966341 3613
7240106046638025731 3618
1756445717121376773 3621
14382066537379517955 3626
5866756650218347011 3629
16272974087764784130 3632
15761227767769414658 3634
18416191208487439875 3636
6907951459458727428 3639
9809719231558661124 3643
4507781411365709320 3647
5884824860548742149 3655
5437654195267052547 3660
11222029271970864132 3663
2994118918064883204 3667
7969121812144744451 3671
3138483343029123079 3674
11692225531691234308 3681
7005452876943918596 3685
16540574446475148804 3689
3142162595591230469 3693
1562164105758214661 3698
3289141220579056646 3703
7235116973696399877 3709
3290493685631181313 3714
12052305452970666500 3715
3659238132420018693 3719
15413495749815386630 3724
1349095549098498052 3730
8600548848988295174 3734
15278270405312088582 3740
1677400654815390213 3746
6944335799113370630 3751
0 3757
15054286073958269445 3757
11524636819290913285 3762
15672162207595698690 3767
8738610060644560902 3769
7413040162646408193 3775
18169133436962543108 3776
7221095417669340676 3780
17150964708707287047 3784
2614675755652403715 3791
9768698864568413701 3794
14233993616792698892 3799
6872602506735524865 3811
6837388664089203716 3812
3698581321878713346 3816
4659349311818858497 3818
17337682331567989762 3819
16786057931923565061 3821
15744010785347485188 3826
17295878380493810694 3830
17845268661399945219 3836
5827961355851241476 3839
286776277701673478 3843
4548722048270233606 3849
14099405731913605125 3855
4486295400879519751 3860
12125867873199726595 3867
18368077667072941574 3870
5404293715565427715 3876
12712115191201926150 3879
6370598154474989571 3885
4454743306504356867 3888
13377479517289350149 3891
15569481732652311555 3896
14914575288330051075 3899
12403912194723859462 3902
11054836060260009986 3908
8604233756927308292 3910
17242531502026106375 3914
1149772682929973251 3921
1217846090326586885 3924
4546442457392422913 3929
17334766631755119618 3930
292723405812293636 3932
17627346709014329860 3936
6078798662781175811 3940
1900486643026391556 3943
17474410257010896899 3947
4978279717022715907 3950
2778804921868839946 3953
12000523230353385475 3963
8890314515408882692 3966
0 3970
9676104834068817410 3970
4098531628311187971 3972
6989464886060309507 3975
5049881779852020742 3978
102597086695403011 3984
9823964299513355780 3987
14121828454496397829 3991
17190852492614386179 3996
4972710749072260612 3999
4001749314797208579 4003
13952444231209003010 4006
16744358854815422466 4008
8127795608347987972 4010
114465556713981957 4014
173339742608088577 4019
6895862388187978244 4020
603085984539084292 4024
120107848305920002 4028
10203785738636978183 4030
12859608392929218051 4037
4007942168105979395 4040
2080492427033352196 4043
7487698026088968198 4047
14189794947817753090 4053
2463630231055130117 4055
11299510633267305985 4060
14498728498471478276 4061
9644588103370248708 4065
11383355991577462786 4069
4955493569336260614 4071
0 4077
1386234221983514628 4077
1313369149250561541 4081
903417014033398275 4086
18189294875174938630 4089
14469081760594239489 4095
14159721903847057924 4096
8017668332460509700 4100
9241091263019633157 4104
14601417607438779401 4109
4584753168917870083 4118
13978513523888848901 4121
6344964491667831810 4126
4588589911319176707 4128
5860716946637224964 4131
12059110109759764485 4135
12813440898584409609 4140
18247199889102181382 4149
8906041867110866951 4155
7391199117316453382 4162
5819695506119986179 4168
11242430695704829955 4171
5649991510954437634 4174
3398000528478559748 4176
6367076320882708483 4180
9328033184155698180 4183
11271628511372963843 4187
3704184971276909058 4190
0 4192
4153125824480143364 4192
6502891621489681411 4196
18414583200230078978 4199
15881153597748490247 4201
2036463440719857671 4208
7208139455456300037 4215
2867506792755729922 4220
18392421146886582275 4222
8221592382213352963 4225
12018189404696638981 4228
7605691703196937733 4233
15156478285531593225 4238
11983919901023261191 4247
10980613162705801729 4254
2793490740434315779 4255
10258211111447649796 4258
14244682075808242695 4262
13278441471654787073 4269
9073603025245464579 4270
9138893508497365505 4273
6486985510963558404 4274
12815880629689744900 4278
5840323547707326980 4282
17992795154578300420 4286
7188473488524673032 4290
9650968119635816451 4298
4862271432814542343 4301
5126107698902858243 4308
7753783516621211649 4311
12251600056609917956 4312
17892135216945785858 4316
6310762958294091782 4318
13863474843302129155 4324
18135142749797092353 4327
12380267938094728197 4328
11467224734294974979 4333
8724492701163999241 4336
11581645889938107907 4345
11788236419570379268 4348
3995949497611986946 4352
8344647901675014662 4354
3617654648872888839 4360
9087024072302936066 4367
1800378642650781190 4369
9079738279259191813 4375
13904115371457856513 4380
261024299316808201 4381
6807698220004493828 4390
16814045920408801285 4394
7157102378104297479 4399
18104850462136691714 4406
768849636123705348 4408
9530547917449168899 4412
8006031543689535491 4415
15030390865382250499 4418
12373636984579679749 4421
1893622243060931073 4426
4091226656007699461 4427
14231006341134665221 4432
13125723803503531011 4437
5966445804241068549 4440
5041665953313495555 4445
17789230849104615427 4448
13718242196369421316 4451
16239009855252881923 4455
16927630575072344578 4458
12730681039021790212 4460
1694086382663150087 4464
8718947912264086022 4471
15238765179459311106 4477
13978635316283488771 4479
9856725068038263810 4482
525841275698420740 4484
16842982667216409601 4488
4122500787496121857 4489
13968246106678019592 4490
13204564752268439556 4498
1419479380120821252 4502
2397465678843210244 4506
16715502490113064964 4510
14499648931261173252 4514
6341573778923413509 4518
16841392495652978689 4523
12514195279220885507 4524
9666258766835377668 4527
2778875136515090948 4531
0 4535
18426782210587359237 4535
12865361501428254213 4540
10787394843155564549 4545
2776295318639177219 4550
8046973542669627906 4553
18148260717468975620 4555
1613488781452134918 4559
8172336265264118279 4565
17081693052561732612 4572
16237950501236291073 4576
8392391541408918533 4577
8931251968786072069 4582
8542921764885180418 4587
9470472619498433538 4589
901981222024827907 4591
13131735431846831618 4594
3882698256558264323 4596
16404857401699193349 4599
12380711598182476803 4604
16186094456309680133 4607
16432157998205992456 4612
9920279823765799942 4620
12616339481945114628 4626
16822073161273746952 4630
8594628600633212934 4638
10817981044110655493 4644
9844067372586569730 4649
5128619234025570819 4651
15167263260635504134 4654
17952770567353131010 4660
5118658223100390919 4662
6228982503626095618 4669
5642645332788020738 4671
16107075109405794822 4673
12284278769481421832 4679
10377642547921984007 4687
16601205450508455428 4694
11666559143093560836 4698
6407720774733313541 4702
963774440512014339 4707
4809475079850445826 4710
9278447537509804548 4712
17185862654551844360 4716
9695553342098799112 4724
8558692834989271045 4732
962614543754489857 4737
1553547621533507587 4738
15153434212400534020 4741
5116223975712918529 4745
5111998655194025987 4746
313103636819528194 4749
5438592096772435459 4751
10365510470175536137 4754
6855715012782022150 4763
3024538069580642817 4769
16742472429918296068 4770
12924517346973836294 4774
3790806697175738884 4780
18190189947825416712 4784
8360884705460588554 4792
11909780455200489989 4802
11810343054191529987 4807
15647869496036295169 4810
412513398407304706 4811
14686898002615878149 4813
8598809720465421831 4818
5189486371465472516 4825
110260787871520771 4829
13841516343411743749 4832
10724255663284537857 4837
5565631291506091523 4838
18353555657030256132 4841
15875447860016275458 4845
8112003905901105155 4847
8602718403900114946 4850
117938027648666626 4852
2893031913239209478 4854
5019069760620149251 4860
97583475437288966 4863
5873749336924261379 4869
12504998215144778241 4872
1353827736622123011 4873
1898410496741122563 4876
13693373082111156226 4879
18082132870069740547 4881
1292057951019413000 4884
6258876973340135428 4892
16489169363829590019 4896
15701633618762358787 4899
13914488111521333761 4902
12254871447098775558 4903
14248690267109428228 4909
12860529305362561541 4913
14194242342154704385 4918
16977163971733436929 4919
3228522401353127939 4920
2295154976383171590 4923
16547003079054213634 4929
4417789032435081223 4931
4422876523688351747 4938
0 4941
3659489065466387457 4941
1619784172289923079 4942
8600895513152529924 4949
1050842731609221123 4953
11757008717921296899 4956
14329248075633414146 4959
14232133858655999490 4961
8704709083004931592 4963
18207045956333526019 4971
5185988650714720259 4974
13529628275274809858 4977
10804496958327835141 4979
7689973652510374916 4984
11396101863003103234 4988
17212217018245174275 4990
6070381292664791045 4993
15533634368139501570 4998
17048527158831456771 5000
1203920733977408516 5003
695676800520161281 5007
1406754003237844481 5008
15691984313433400836 5009
14531064384758914564 5013
10837711611202277894 5017
2926318809112930308 5023
10159648870316367875 5027
11566858212599568897 5030
7059031027951755778 5031
2984813724380697603 5033
12009720736085212676 5036
18211055476826914307 5040
13061251952142904837 5043
10757239089315382277 5048
1462228017357395972 5053
15640187074420677637 5057
17088040301524619269 5062
18114271904559916039 5067
13823859947033415171 5074
581999688325783046 5077
15683367384740512769 5083
208600152442375 5084
1201580173890709000 5091
12606361960832576517 5099
0 5104
8931089376684759558 5104
3271554781083604995 5110
7460494964945523205 5113
2722625589600949766 5118
1616995124194589189 5124
11902711955062972422 5129
1274063952699499010 5135
16068633877522474499 5137
15848929144037489674 5140
7831541368361469956 5150
658033048571530760 5154
13929320007107549190 5162
3115679009332886532 5168
9736649464720172549 5172
5267106433225081858 5177
10111685724913617923 5179
15622744730783467009 5182
7254573118100577799 5183
10850366468018628099 5190
14193639490077596162 5193
10501888748841043979 5195
9464245848449792517 5206
6272015894781725190 5211
11516991521632351236 5217
2352503424039588353 5221
1535688922562094086 5222
15705088852360739845 5228
0 5233
0 5233
12195783308574042121 5233
14597108197861441539 5242
404717223097170434 5245
9692591235625892356 5247
11510479571637602821 5251
4296993212271759365 5256
14899258104987170310 5261
4219665005023814661 5267
17973894738755630086 5272
5044183081588426243 5278
5783508372603312135 5281
15045380620683811841 5288
0 5289
15695460375845349891 5289
10539286585069022724 5292
16452718323718307330 5296
1942973717378892803 5298
3754588608122333699 5301
9875838348526828038 5304
2857419695636180485 5310
10341338127425019393 5315
13794742222441277955 5316
11481845902083343364 5319
14406267866268187654 5323
8504914184482990086 5329
15696399069296852998 5335
7228768234308289540 5341
17193980643638495746 5345
18081325126638023684 5347
0 5351
13242402023742373381 5351
15444771226459674629 5356
10134126005071706115 5361
1748990318787936257 5364
5113080910719372805 5365
4740943574073903622 5370
6157660124169726978 5376
2025011312955855874 5378
553669187682665990 5380
8084980747942317060 5386
15008869680035365894 5390
11054642401147826182 5396
11851843011455558658 5402
5049575986295398406 5404
632151361685154307 5410
10505264060559523335 5413
12203685200692785669 5420
9008107105681251333 5425
9776735518460342274 5430
6535838863651520514 5432
9576661017186082821 5434
9893784827470222339 5439
4857181768617536005 5442
12822028549600263686 5447
12173840663449246209 5453
8493988363445838855 5454
12471223318525150723 5461
13978362971313364483 5464
1104232390588024323 5467
1100802304281005062 5470
12024887841397697539 5476
3112215802325257732 5479
6207703215900065798 5483
10107845338520962561 5489
4948379519093757442 5490
9040023578523767298 5492
12460867427268007427 5494
17640575321947182081 5497
14924017377560164868 5498
13037662692055299079 5502
17574020021597698051 5509
2372904617320605187 5512
3536299651807321604 5515
17491514705714699777 5519
1503367428551203333 5520
11663038372561771528 5525
11356551836020425733 5533
14927003250941647877 5538
11686166360497265671 5543
3751812866770461698 5550
9235429159371094533 5552
10925066066795389445 5557
13848442946975464962 5562
15127509745617130499 5564
12814854901058743300 5567
11798071986715611653 5571
9003722218263351299 5576
16991506189565667331 5579
981278872611282433 5582
10035036946077778435 5583
7029445286012767749 5586
14504769452400850950 5591
17475474682515088899 5597
67574918893732867 5600
8838928040323481604 5603
8681421403122425863 5607
7992933341854691334 5614
6560668097211870211 5620
782591258325690884 5623
8459715981795762693 5627
4580377521775126533 5632
530574303038066691 5637
17334925489416748035 5640
10917945826566401031 5643
11425792728280789508 5650
11880471673070615043 5654
11631630236968277507 5657
13432232158299137029 5660
10476683503031344138 5665
6005753640415255045 5675
4494528211652260354 5680
5088699063729523205 5682
16605408072272507396 5687
5965728564066983431 5691
12045126901259601922 5698
13407389751313554951 5700
10265378039037804036 5707
17128306037403366403 5711
6930510487252484102 5714
4683881276581771782 5720
8773712597668112386 5726
7718603456686202883 5728
816893400114994692 5731
12215564487282997764 5735
13309584590655820293 5739
17802213776802985989 5744
18262436632290822657 5749
1166288764831559172 5750
13852067026635056644 5754
14826571289824620035 5758
4783906813271651845 5761
16110743783092945929 5766
3392445819987063810 5775
759677515271549442 5777
4954134767103967235 5779
7199695795476264968 5782
13425017433253156357 5790
4598183349583802373 5795
13368149528004463109 5800
7353867998927470594 5805
14027611490475757572 5807
15263300491627962372 5811
3261710534261977605 5815
16372386599130303492 5820
17447749519143236102 5824
8820939560759511556 5830
14168934767906123266 5834
1272094227362214403 5836
16884210783475644934 5839
6489513794935318530 5845
720893495779325446 5847
8004663725400207876 5853
7925944396283898885 5857
16471847542878583812 5862
6051400597942863874 5866
10447089147275700741 5868
12420007994079107078 5873
2743808713933127682 5879
3922281465068971521 5881
9641401502742986761 5882
7025197893433436681 5891
8464537216665311745 5900
5229975051983696902 5901
13219483540352648710 5907
6891970947383493637 5913
15509803201271371267 5918
15800746157798133762 5921
7494844196229054468 5923
2478755409956858376 5927
776981985281303557 5935
11740421185520662020 5940
8557461902491580934 5944
6615098483818553858 5950
4619069333445224449 5952
11582842649688561154 5953
13113788936574663684 5955
4492831876575923713 5959
3749003631842744836 5960
18217039131397133318 5964
15935794757369731074 5970
18178081874058316293 5972
5698328755092800515 5977
924345980000004099 5980
15391279659382430725 5983
2629878169764907012 5988
4980088919461560837 5992
2390559727735566340 5997
18190655124317003782 6001
16690777444619791873 6007
5111514005222631427 6008
5463222638937838601 6011
15935286318740422665 6020
4601720812009204226 6029
4573416748891166722 6031
11625706448292708867 6033
306546757229797379 6036
5928989440750977029 6039
10860678781281246723 6044
17363380333704943108 6047
12626658549687686146 6051
8508105012190377988 6053
13397258843768268289 6057
2329867729858872838 6058
6319578584393519619 6064
648714822056359939 6067
9778814147907384837 6070
4782194177622378502 6075
5940845406586789893 6081
10944055863898710532 6086
9804555614801620995 6090
3243921131443177480 6093
3363729399721306626 6101
2694824434710392322 6103
10930158767133753860 6105
3086947634316383749 6109
14689680169795335684 6114
14169645236166264325 6118
5766307716524312072 6123
15588338815484165635 6131
1879909569814783489 6134
7648000293313816073 6135
9707181328610653700 6144
2550886158896312836 6148
12264015729671425541 6152
12250840876809084931 6157
2325163999546039811 6160
8090712276727686662 6163
3561622135751247368 6169
12428098442981778434 6177
5317074378092887557 6179
3293128764834931203 6184
6501539462102225925 6187
8841444808704975873 6192
14795478358927854600 6193
11543118218929331715 6201
17590593535945238019 6204
17201280632479248899 6207
1869094785143730182 6210
12095342838504642051 6216
14332192655141400068 6219
16006857683617781762 6223
13800397681604810244 6225
9335536499310733828 6229
6519249660804306433 6233
15000310314582189060 6234
2775443890301194244 6238
6999351997519495684 6242
2193062667869819911 6246
9580477704244001283 6253
2049131530735872518 6256
1901162351041197059 6262
2875261889782423044 6265
744785531861186566 6269
740331390282101250 6275
2834213319463573505 6277
13092787216891636230 6278
17187171220952344072 6284
3822684967466794501 6292
1702231969495806982 6297
889324199902394372 6303
5588191033639956997 6307
3744301050105801730 6312
5948176534768694787 6314
17549670793917020164 6317
1539504214284669445 6321
1961430315639129606 6326
865138743269174277 6332
13779872344001562119 6337
749841490366281735 6344
370366796276637186 6351
6563504091576679428 6353
4380014957543785476 6357
10351204487081468936 6361
14023876399415748613 6369
4887296606049584133 6374
10236007245057672194 6379
1963957521204852227 6381
3544381531835458051 6384
4467316503871596546 6387
7586267349699624966 6389
3431004678615592450 6395
10570013355553256966 6397
7244195578605442563 6403
6701816902201590279 6406
4940881348273062404 6413
16104514017865230850 6417
9415936248796381188 6419
3230108127326351876 6423
13932818959429724166 6427
8712348641097257477 6433
18103630802950382083 6438
12398973386989278726 6441
3219533089649746437 6447
6290102361443240964 6452
10332879499337892873 6456
2005846858137644033 6465
17321629815133772292 6466
12526741080849233923 6470
7932828292743261700 6473
3418771465306118150 6477
6688894864231285251 6483
13744437326327367685 6486
4639841471612583429 6491
15561698488434945025 6496
14842394190751288321 6497
2133051154224139269 6498
16839096353782439939 6503
3290706488454416899 6506
7886369044150052869 6509
13220777477059960324 6514
8952228474184094724 6518
1556074372706545666 6522
12244020250318504451 6524
8716248224613385730 6527
8093345746615195650 6529
13780092881500069380 6531
4530692743391660039 6535
12734146969745873922 6542
11289214500525457927 6544
9575487044215824897 6551
2144698396513178625 6552
14284428882875800581 6553
5709589754608808451 6558
0 6561
9917948887644861445 6561
14431208557535975427 6566
9567809156604564996 6569
8710430089813247493 6573
3828335333182556161 6578
2216131334191299588 6579
1276616304051198982 6583
18328943126583720452 6589
17263736866258471938 6593
1146391532348252677 6595
11024404375468255746 6600
17228334519141824006 6602
13561301863975277570 6608
3751109463627572745 6610
12977367319368771077 6619
11017590245904668677 6624
6429003927082400769 6629
15980526593137821700 6630
10534103997333509635 6634
4514332674264269825 6637
1528094942432261 6638
12173909081816589826 6643
183517580463285763 6645
8517032698989345286 6648
7115066882665331718 6654
2566818993251168775 6660
9368992790350793731 6667
9166789638774720516 6670
15079358786545446918 6674
2185557574252684294 6680
18056985379025629701 6686
12535961682376707587 6691
11851945142712594434 6694
7627172168424760324 6696
17944585482911861250 6700
15849614722920903687 6702
2668461721297078275 6709
16023087332423670787 6712
16247801720769274884 6715
9142715171981265927 6719
4313627074153320964 6726
1574784871857860099 6730
10438141099357345282 6733
4117642850043155457 6735
7416594995698837510 6736
7491335401177827847 6742
999772280226214404 6749
14300137132498749956 6753
11917616424429924869 6757
10375470899065353223 6762
10169138785478750211 6769
14204988181069352961 6772
14721733831675986946 6773
4210584362875015686 6775
7317455187149169158 6781
6256325207519993355 6787
17307466709656047107 6798
12449910579172817925 6801
17117327289179107846 6806
12204503725864039425 6812
8587479573876999173 6813
13357534600380797444 6818
16924498399316170243 6822
10385795421598850051 6825
15693231046972250116 6828
7734836985073539079 6832
5475345640306229762 6839
8682265953165714950 6841
15495325273691446280 6847
3420038705144251395 6855
7251140871800046081 6858
981699756862875652 6859
16048654718395234311 6863
8079678211237274626 6870
17330964965463092229 6872
204998850760340482 6877
18341495060807385089 6879
0 6880
10330614754041761797 6880
6569474263331988995 6885
10151163022537904132 6888
6973077903683613700 6892
14823983621891646468 6896
4588791582583577091 6900
7738659980315072514 6903
17781357705759544325 6905
16052303612535971329 6910
15667766045744763395 6911
6980389294886772227 6914
14613524072384819719 6917
8059455877733662209 6924
10539657214160512007 6925
11616619521633214977 6932
14224732868845830148 6933
1599514425208358916 6937
14897125022827391489 6941
17618243532524716547 6942
12937125504387172865 6945
8071819989785685507 6946
13114810333443126785 6949
11089061982263568387 6950
7512050791922835458 6953
8222146541757369347 6955
9515352071601081347 6958
17127940202801999362 6961
17358081333094451204 6963
12815500919803761668 6967
5161865702872029702 6971
5085872907714726404 6977
12867302697661638661 6981
738635139511943685 6986
7502486089554604548 6991
4424538564647398918 6995
13033530442197720066 7001
6601067310912141828 7003
1366953120023462405 7007
0 7012
373035175951056903 7012
10367937030873553922 7019
7387148186552064514 7021
4451982393641993219 7023
1579274675138636802 7026
2005972906238723082 7028
8365560780332633605 7038
18252698082741376517 7043
10687245525977179652 7048
4847932655264917512 7052
1908452749238848516 7060
6974472620105490949 7064
4229863270655526913 7069
10085099300306882057 7070
17958427850227237893 7079
11171712079059576835 7084
15887785057120482307 7087
13778764465009986563 7090
2024558227009405443 7093
2645457411458513412 7096
9511844619849197061 7100
17006463209877258757 7105
10936200410456409095 7110
3336397438630617091 7117
6926069371323713540 7120
8379889490656065540 7124
3625594756061307394 7128
5913498723740950018 7130
12484239622695376900 7132
10051602445201488389 7136
18057842454501173761 7141
10321164942757956098 7142
2085863817939845636 7144
637792840422552070 7148
5775914883929950210 7154
4294440544947172871 7156
1470884227132728324 7163
16547746967068243460 7167
2181778157642243587 7171
14805614303640410630 7174
10407211148095012357 7180
7300854148390629377 7185
10669095767865426949 7186
15733785095671659523 7191
11806922681806601737 7194
25481766866507271 7203
12569152301666821634 7210
13887779286276890116 7212
7527919625682468355 7216
17922524530616125955 7219
0 7222
11443084099398646276 7222
12286354644189494278 7226
17630285722782908417 7232
18436478724478563329 7233
18200429394767296004 7234
16672878022210267141 7238
4512918066122139140 7243
12031526121929858052 7247
14212642254166041603 7251
8575300375201110535 7254
16514096733739064836 7261
1372144160287681027 7265
15124745564957097988 7268
10223452831275718661 7272
10095462828218450948 7277
10267568820449235459 7281
8469965405176075784 7284
9411785803579933193 7292
13375379691633666053 7301
5561046853266212356 7306
5600517863682136579 7310
4206747353107879938 7313
6909661555018396678 7315
4417053658040592898 7321
9011207054761699331 7323
15847766482649990661 7326
18310070108073323522 7331
2313624043931823623 7333
10185320666992114180 7340
11916926699710288898 7344
3545425776481026568 7346
4911891633544977922 7354
6138519775096177157 7356
13049919356836375556 7361
15829456196869805060 7365
11413888162709001731 7369
3300615883971422727 7372
4415199397635384323 7379
4078185095297996292 7382
5050132448655584777 7386
6103646993143324675 7395
3793253264149160449 7398
16347356082607946243 7399
3857792844626733059 7402
13036132457540813314 7405
3317522113538233860 7407
6305735953325256196 7411
6860732809698012168 7415
6541633460102011907 7423
3961099792723844610 7426
7089802930014850051 7428
13336068690935240707 7431
10056644085184719362 7434
11207965588169773573 7436
2355374993394737153 7441
17990578805700388865 7442
5383591927836860933 7443
13480144226871606785 7448
4996232125830537221 7449
11235167738243785734 7454
143923373352141317 7460
8974578467632463364 7465
17864556342494699522 7469
11663093833306126343 7471
15103674999204478981 7478
14009898996985431557 7483
3460032664591823370 7488
8367107077597996035 7498
10237320221820149762 7501
1230491654079345668 7503
5914481805353637890 7507
1999423877124190726 7509
4194589414523475459 7515
6778899120031142917 7518
6259706092385260035 7523
12578917588074039300 7526
842849858858196483 7530
521961307927385604 7533
17870457945874248706 7537
11610460273728938500 7539
13002243795339621894 7543
12765037571141596167 7549
14619375725711845380 7556
9898817210922070535 7560
7087049801313293826 7567
10788149532662318086 7569
11883745714487623174 7575
9160587494551387144 7581
12948796790808401415 7589
15459692796244702212 7596
13669023181354473475 7600
8297900856639261187 7603
8973562188479754242 7606
1741536580090567683 7608
9618746069312002053 7611
14055601259453352453 7616
7235233866577679879 7621
11392475556674295813 7628
2155357865374380549 7633
12303341912019606531 7638
5824983256326052360 7641
14021022753924725763 7649
7529297856837936645 7652
7626036300525324802 7657
13470102056185236484 7659
14040234972562250248 7663
3092555032572210694 7671
351921127336245764 7677
18352729336655478276 7681
4115012278704262148 7685
15607965751654339588 7689
17876209822256179201 7693
16572837449335793665 7694
8663418737724652548 7695
13305660029461998085 7699
11958592580840442371 7704
12164924667918544388 7707
14419240429041575941 7711
10751379426943696897 7716
13859991162413006342 7717
6196669303248639490 7723
17621166842638855686 7725
6938529564969770501 7731
199770165813218817 7736
9794627124586530817 7737
10042945289721419780 7738
15124336629718367234 7742
17239762101737752070 7744
5066859136028226563 7750
18342141343814928386 7753
14297580412569375748 7755
5716198931408879112 7759
17629167193054472197 7767
3840533914406490629 7772
2628101470761528321 7777
14197211868061374980 7778
5035129043470395400 7782
11015175427449999873 7790
12059984061354081796 7791
7621245355524176387 7795
7205828901486151173 7798
16192222390146865670 7803
1543156989008861701 7809
11571041007873040389 7814
16667674860570698246 7819
2792459496922037256 7825
1716286101354276872 7833
6892728786412752387 7841
5493465003035191811 7844
12724100965955726852 7847
485317178080522244 7851
7255092882374689283 7855
3746112348748737537 7858
11741059179006117890 7859
13078798732771974662 7861
1952753305616740355 7867
2942432464334385155 7870
14721738681901483012 7873
1053013354524276739 7877
12349895812339935238 7880
3439161449500354054 7886
3350328017673840644 7892
8037543239976981511 7896
16626903114423534083 7903
13087643897752933381 7906
349987452515442689 7911
0 7912
17467123943804556801 7912
1793445310925094917 7913
14598490873474125825 7918
8308390887087095303 7919
16158446523729277959 7926
15491096967236155908 7933
4171042813813231107 7937
10827160934573197316 7940
9642746569099865093 7944
13785771297862324740 7949
5796988451593437188 7953
14917478676441368579 7957
17874504114098815493 7960
2708122882887417858 7965
14322132912803469828 7967
12065320292649433090 7971
888797480150426630 7973
395125046520925188 7979
10520966495478106633 7983
5169469121626948612 7992
17273179268589918723 7996
